MicroBlog/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["title", "shivanjalee"], ["body", "This is my first blog\n"], ["created_at", "2021-12-29 08:00:05.819661"], ["updated_at", "2021-12-29 08:00:05.819661"], ["slug", "shivanjalee"]]
---
  def create
    @blog = Blog.new(blog_params)

    if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."slug" = ? LIMIT ?  [["slug", "shivanjalee"], ["LIMIT", 1]]
---
  def find_id
    @blog = Blog.find_by(slug: params[:id])