MicroBlog/app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def create
    @blog = Blog.find(params[:blog_id])